
Feature: Вход в системата

  Scenario: Вхов в системата с валидни потребителски данни
    Given Потребитеял отваря екрана за вход в системата
    When Потребителя въведе потребителско име "Ivan"
    And Въведе парола "Pass123!"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "Успешно влязохте в системата!"
    
  Scenario: Вхов в системата с невалидни потребителски данни
    Given Потребитеял отваря екрана за вход в системата
    When Потребителя въведе потребителско име "123Ivan"
    And Въведе парола "123Pass123!"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "Поребител с тези данни не съществува!"
    
  Scenario: Вхов в системата с без потребителски данни
    Given Потребитеял отваря екрана за вход в системата
    When Натисне върху бутона за вход в системата
    Then Вижда съобщение "Не сте въвели потребилтески данни!"
    
  Scenario: Вхов в системата потребителско име
    Given Потребитеял отваря екрана за вход в системата
    When Въведе парола "123Pass123!"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "Въведете потребителско име!"
    
  Scenario: Вхов в системата без парола
    Given Потребитеял отваря екрана за вход в системата
    When Потребителя въведе потребителско име "123Ivan"
    And Натисне върху бутона за вход в системата
    Then Вижда съобщение "Въведете парола!"
